--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\User\private\Desktop\stata\findar_final\findar_example.log
  log type:  text
 opened on:  16 Dec 2025, 19:50:06

. 
. display as text "{hline 80}"
--------------------------------------------------------------------------------

. display as text "findar - Search arXiv papers and discover GitHub repositories"
findar - Search arXiv papers and discover GitHub repositories

. display as text "Version 1.1.5"
Version 1.1.5

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. ********************************************************************************
. * Example 1: Basic search using simplified syntax
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 1: Basic search - simplified syntax (5 results)"
Example 1: Basic search - simplified syntax (5 results)

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. findar deep learning

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: deep learning
Max results: 5
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 5 papers.

Starting GitHub search...

  [1/5] Learn to Accumulate Evidence from All Training Samples:...

  [2/5] The Modern Mathematics of Deep Learning...

  [3/5] Deep Learning and Computational Physics (Lecture Notes)...

  [4/5] A multitask deep learning model for real-time deploymen...

  [5/5] DILIE: Deep Internal Learning for Image Enhancement...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 5
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 5 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] Learn to Accumulate Evidence from All Training Samples: Theo
Links: arXiv PDF
--------------------------------------------------------------------------------

[2] The Modern Mathematics of Deep Learning
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

[3] Deep Learning and Computational Physics (Lecture Notes)
Links: arXiv PDF
--------------------------------------------------------------------------------

[4] A multitask deep learning model for real-time deployment in 
Links: arXiv PDF
--------------------------------------------------------------------------------

[5] DILIE: Deep Internal Learning for Image Enhancement
Links: arXiv PDF
--------------------------------------------------------------------------------

. 
. ********************************************************************************
. * Example 2: Search with specified number of results
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 2: Search with 3 results"
Example 2: Search with 3 results

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. findar machine learning, maxresults(3)

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: machine learning
Max results: 3
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 3 papers.

Starting GitHub search...

  [1/3] Changing Data Sources in the Age of Machine Learning fo...

  [2/3] DOME: Recommendations for supervised machine learning v...

  [3/3] Learning Curves for Decision Making in Supervised Machi...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 3
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 3 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] Changing Data Sources in the Age of Machine Learning for Off
Links: arXiv PDF
--------------------------------------------------------------------------------

[2] DOME: Recommendations for supervised machine learning valida
Links: arXiv PDF
--------------------------------------------------------------------------------

[3] Learning Curves for Decision Making in Supervised Machine Le
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

. 
. ********************************************************************************
. * Example 3: Display abstracts
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 3: Display abstracts"
Example 3: Display abstracts

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. findar transformer attention, maxresults(2) abstract

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: transformer attention
Max results: 2
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

Starting GitHub search...

  [1/2] Dilated Neighborhood Attention Transformer...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 1
  Not found:                 0
  Success rate:              50%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 2 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] Dilated Neighborhood Attention Transformer
Links: arXiv PDF GitHub(1163stars)

Abstract:
  Transformers are quickly becoming one of the most heavily applied deep 
  learning architectures across modalities, domains, and tasks. In vision, 
  on top of ongoing efforts into plain transformers, hierarchical 
  transformers have also gained significant attention, thanks to their 
  performance and easy integration into existing frameworks. These models 
  typically employ localized attention mechanisms, such as the 
  sliding-window Neighborhood Attention (NA) or Swin Transformer's Shifted 
  Window Self Attention. While effective at reducing self attention's 
  quadratic complexity, local attention weakens two of the most desirable 
  properties of self attention: long range inter-dependency modeling, and 
  global receptive field. In this paper, we introduce Dilated Neighborhood 
  Attention (DiNA), a natural, flexible and efficient extension to NA that 
  can capture more global context and expand receptive fields exponentially 
  at no additional cost. NA's local attention and DiNA's sparse global 
  attention complement each other, and therefore we introduce Dilated 
  Neighborhood Attention Transformer (DiNAT), a new hierarchical vision 
  transformer built upon both. DiNAT variants enjoy significant improvements 
  over strong baselines such as NAT, Swin, and ConvNeXt. Our large model is 
  faster and ahead of its Swin counterpart by 1.6% box AP in COCO object 
  detection, 1.4% mask AP in COCO instance segmentation, and 1.4% mIoU in 
  ADE20K semantic segmentation. Paired with new frameworks, our large 
  variant is the new state of the art panoptic segmentation model on COCO 
  (58.5 PQ) and ADE20K (49.4 PQ), and instance segmentation model on 
  Cityscapes (45.1 AP) and ADE20K (35.4 AP) (no extra data). It also matches 
  the state of the art specialized semantic segmentation models on ADE20K 
  (58.1 mIoU), and ranks second on Cityscapes (84.5 mIoU) (no extra data).
--------------------------------------------------------------------------------

[2] Mask-Attention-Free Transformer for 3D Instance Segmentation
Links: arXiv PDF

Abstract:
  Recently, transformer-based methods have dominated 3D instance 
  segmentation, where mask attention is commonly involved. Specifically, 
  object queries are guided by the initial instance masks in the first 
  cross-attention, and then iteratively refine themselves in a similar 
  manner. However, we observe that the mask-attention pipeline usually leads 
  to slow convergence due to low-recall initial instance masks. Therefore, 
  we abandon the mask attention design and resort to an auxiliary center 
  regression task instead. Through center regression, we effectively 
  overcome the low-recall issue and perform cross-attention by imposing 
  positional prior. To reach this goal, we develop a series of 
  position-aware designs. First, we learn a spatial distribution of 3D 
  locations as the initial position queries. They spread over the 3D space 
  densely, and thus can easily capture the objects in a scene with a high 
  recall. Moreover, we present relative position encoding for the 
  cross-attention and iterative refinement for more accurate position 
  queries. Experiments show that our approach converges 4x faster than 
  existing work, sets a new state of the art on ScanNetv2 3D instance 
  segmentation benchmark, and also demonstrates superior performance across 
  various datasets. Code and models are available at 
  https://github.com/dvlab-research/Mask-Attention-Free-Transformer.
--------------------------------------------------------------------------------

. 
. ********************************************************************************
. * Example 4: Detailed mode
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 4: Detailed information mode"
Example 4: Detailed information mode

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. findar reinforcement learning, maxresults(2) detail

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: reinforcement learning
Max results: 2
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

Starting GitHub search...

  [1/2] ARLBench: Flexible and Efficient Benchmarking for Hyper...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 1
  Not found:                 0
  Success rate:              50%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Detailed Results
--------------------------------------------------------------------------------

[1] ARLBench: Flexible and Efficient Benchmarking for Hyperparameter Optimization in Reinforcement
>  Learning
Authors: Jannis Becktepe, Julian Dierkes, Carolin Benjamins, Aditya Mohan, David Salinas, Raghu Ra
> jan, Frank Hutter, Holger Hoos, Marius Lindauer, Theresa Eimer
Published: 2024-09-27T15:22:28Z

Links: arXiv  Google  GitHub(automl/arlbench_★26_Python)
--------------------------------------------------------------------------------

[2] Causal-Paced Deep Reinforcement Learning
Authors: Geonwoo Cho, Jaegyun Im, Doyoon Kim, Sundong Kim
Published: 2025-06-24T20:15:01Z

Links: arXiv  Google  
--------------------------------------------------------------------------------

. 
. ********************************************************************************
. * Example 5: Search without GitHub integration
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 5: Disable GitHub search"
Example 5: Disable GitHub search

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. findar neural networks, maxresults(2) nogithub

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: neural networks
Max results: 2
GitHub search: DISABLED
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

--------------------------------------------------------------------------------
Top 2 results (arXiv | PDF | DOI)
--------------------------------------------------------------------------------

[1] The Deep Arbitrary Polynomial Chaos Neural Network or how De
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

[2] Learning Active Subspaces and Discovering Important Features
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

. 
. ********************************************************************************
. * Example 6: Standard syntax with query option
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 6: Standard syntax"
Example 6: Standard syntax

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. findar, query("computer vision") maxresults(2)

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: computer vision
Max results: 2
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

Starting GitHub search...

  [1/2] WiCV 2019: The Sixth Women In Computer Vision Workshop...

  [2/2] Spatial Monitoring and Insect Behavioural Analysis Usin...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 2
  Success rate:              0%
--------------------------------------------------------------------------------

. 
. ********************************************************************************
. * Example 7: Save results to memory (new in v1.1.5)
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 7: Save results to memory"
Example 7: Save results to memory

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. clear

. findar deep learning, maxresults(5) save

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: deep learning
Max results: 5
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 5 papers.

Starting GitHub search...

  [1/5] Learn to Accumulate Evidence from All Training Samples:...

  [2/5] The Modern Mathematics of Deep Learning...

  [3/5] Deep Learning and Computational Physics (Lecture Notes)...

  [4/5] A multitask deep learning model for real-time deploymen...

  [5/5] DILIE: Deep Internal Learning for Image Enhancement...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 5
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 5 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] Learn to Accumulate Evidence from All Training Samples: Theo
Links: arXiv PDF
--------------------------------------------------------------------------------

[2] The Modern Mathematics of Deep Learning
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

[3] Deep Learning and Computational Physics (Lecture Notes)
Links: arXiv PDF
--------------------------------------------------------------------------------

[4] A multitask deep learning model for real-time deployment in 
Links: arXiv PDF
--------------------------------------------------------------------------------

[5] DILIE: Deep Internal Learning for Image Enhancement
Links: arXiv PDF
--------------------------------------------------------------------------------

Data saved to memory (use browse to view)

. 
. * Display the saved data
. display as text _n "Dataset in memory:"

Dataset in memory:

. describe

Contains data
 Observations:             5                  
    Variables:            12                  
--------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------------------------
arxiv_id        str50   %50s                  
title           str500  %500s                 
summary         strL    %9s                   
authors         str1000 %1000s                
published       str30   %30s                  
comment         strL    %9s                   
doi             str100  %100s                 
gh_source       str50   %50s                  
gh_repo         str200  %200s                 
gh_url          str300  %300s                 
gh_stars        long    %12.0g                
gh_lang         str50   %50s                  
--------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. display as text _n "First 3 results:"

First 3 results:

. list title arxiv_id in 1/3, clean noobs abbreviate(50)

                                                                          title       arxiv_id  
    Learn to Accumulate Evidence from All Training Samples: Theory and Practice   2306.11113v2  
                                        The Modern Mathematics of Deep Learning   2105.04026v2  
                        Deep Learning and Computational Physics (Lecture Notes)   2301.00942v1  

. 
. display as text _n "GitHub information (if any):"

GitHub information (if any):

. list title gh_repo gh_stars if gh_url != "", clean noobs abbreviate(30)

. 
. ********************************************************************************
. * Example 8: Save results to dataset file
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 8: Save results to file"
Example 8: Save results to file

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. clear

. findar causal inference, maxresults(5) saving(findar_results) replace

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: causal inference
Max results: 5
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 5 papers.

Starting GitHub search...

  [1/5] Causal inference via algebraic geometry: feasibility te...

  [2/5] Quantitative probing: Validating causal models using qu...

  [3/5] A Unifying Causal Framework for Analyzing Dataset Shift...

  [4/5] OpportunityFinder: A Framework for Automated Causal Inf...

  [5/5] Text as Causal Mediators: Research Design for Causal Es...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 5
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 5 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] Causal inference via algebraic geometry: feasibility tests f
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

[2] Quantitative probing: Validating causal models using quantit
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

[3] A Unifying Causal Framework for Analyzing Dataset Shift-stab
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

[4] OpportunityFinder: A Framework for Automated Causal Inferenc
Links: arXiv PDF
--------------------------------------------------------------------------------

[5] Text as Causal Mediators: Research Design for Causal Estimat
Links: arXiv PDF
--------------------------------------------------------------------------------
(file findar_results.dta not found)
file findar_results.dta saved

Data saved to file: findar_results

. 
. * Display the saved data
. display as text _n "Saved dataset structure:"

Saved dataset structure:

. describe

Contains data from findar_results.dta
 Observations:             5                  
    Variables:            12                  16 Dec 2025 19:50
--------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------------------------
arxiv_id        str50   %50s                  
title           str500  %500s                 
summary         strL    %9s                   
authors         str1000 %1000s                
published       str30   %30s                  
comment         strL    %9s                   
doi             str100  %100s                 
gh_source       str50   %50s                  
gh_repo         str200  %200s                 
gh_url          str300  %300s                 
gh_stars        long    %12.0g                
gh_lang         str50   %50s                  
--------------------------------------------------------------------------------------------------
Sorted by: 

. 
. display as text _n "First 5 results:"

First 5 results:

. list title arxiv_id published in 1/5, clean noobs

                                                                                                  
>                            title       arxiv_id              published  
    Causal inference via algebraic geometry: feasibility tests for functional causal structures wi
> th two binary observed variables   1506.03880v2   2015-06-12T00:51:44Z  
                                                Quantitative probing: Validating causal models usi
> ng quantitative domain knowledge   2209.03013v1   2022-09-07T09:19:11Z  
                                                A Unifying Causal Framework for Analyzing Dataset 
> Shift-stable Learning Algorithms   1905.11374v5   2019-05-27T17:56:39Z  
                                                                     OpportunityFinder: A Framewor
> k for Automated Causal Inference   2309.13103v1   2023-09-22T17:35:03Z  
    Text as Causal Mediators: Research Design for Causal Estimates of Differential Treatment of So
> cial Groups via Language Aspects   2109.07542v1   2021-09-15T19:15:35Z  

. 
. display as text _n "GitHub information:"

GitHub information:

. list title gh_repo gh_stars gh_lang if gh_url != "", ///
>     clean noobs abbreviate(30)

. 
. ********************************************************************************
. * Example 9: Combine detail and save options
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 9: Combine detail + save to memory"
Example 9: Combine detail + save to memory

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. clear

. findar graph neural network, maxresults(2) detail save

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: graph neural network
Max results: 2
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

Starting GitHub search...

  [1/2] A Tutorial about Random Neural Networks in Supervised L...

  [2/2] Learning Universal Graph Neural Network Embeddings With...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 2
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Detailed Results
--------------------------------------------------------------------------------

[1] A Tutorial about Random Neural Networks in Supervised Learning
Authors: Sebastián Basterrech, Gerardo Rubino
Published: 2016-09-15T20:21:30Z

Links: arXiv  Google  
--------------------------------------------------------------------------------

[2] Learning Universal Graph Neural Network Embeddings With Aid Of Transfer Learning
Authors: Saurabh Verma, Zhi-Li Zhang
Published: 2019-09-22T20:21:15Z

Links: arXiv  Google  
--------------------------------------------------------------------------------

Data saved to memory (use browse to view)

. 
. display as text _n "Data structure:"

Data structure:

. describe, short

Contains data
 Observations:             2                  
    Variables:            12                  
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. display as text _n "Saved papers:"

Saved papers:

. list title authors in 1/2, clean noobs abbreviate(40)

                                                                               title              
>                   authors  
                      A Tutorial about Random Neural Networks in Supervised Learning   Sebastián B
> asterrech, Gerardo Rubino  
    Learning Universal Graph Neural Network Embeddings With Aid Of Transfer Learning            Sa
> urabh Verma, Zhi-Li Zhang  

. 
. ********************************************************************************
. * Example 10: Check stored results
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 10: Stored results"
Example 10: Stored results

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. findar bayesian inference, maxresults(3)

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: bayesian inference
Max results: 3
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 3 papers.

Starting GitHub search...

  [1/3] Bayesian Nonparametric Weighted Sampling Inference...

  [2/3] Bayesian Inference in Quantum Programs...

  [3/3] Approximate Inference for Fully Bayesian Gaussian Proce...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 3
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 3 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] Bayesian Nonparametric Weighted Sampling Inference
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

[2] Bayesian Inference in Quantum Programs
Links: arXiv PDF
--------------------------------------------------------------------------------

[3] Approximate Inference for Fully Bayesian Gaussian Process Re
Links: arXiv PDF
--------------------------------------------------------------------------------

. 
. display as text _n "Stored results:"

Stored results:

. display as text "  Papers found: " as result r(count)
  Papers found: 3

. display as text "  GitHub repos found: " as result r(arxiv_found)
  GitHub repos found: 0

. display as text "  Not found: " as result r(not_found)
  Not found: 3

. 
. ********************************************************************************
. * Example 11: Search for specific topics
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 11: Specific research topics"
Example 11: Specific research topics

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. * Natural language processing
. display as text _n "Topic: Natural Language Processing"

Topic: Natural Language Processing

. findar natural language processing, maxresults(2)

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: natural language processing
Max results: 2
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

Starting GitHub search...

  [1/2] An Open Natural Language Processing Development Framewo...

  [2/2] A Comprehensive Review of State-of-The-Art Methods for ...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 2
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 2 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] An Open Natural Language Processing Development Framework fo
Links: arXiv PDF
--------------------------------------------------------------------------------

[2] A Comprehensive Review of State-of-The-Art Methods for Java 
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

. 
. * Time series analysis  
. display as text _n "Topic: Time Series"

Topic: Time Series

. findar time series forecasting, maxresults(2)

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: time series forecasting
Max results: 2
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

Starting GitHub search...

  [1/2] LLM-Mixer: Multiscale Mixing in LLMs for Time Series Fo...

  [2/2] Probabilistic Hierarchical Forecasting with Deep Poisso...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 2
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 2 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] LLM-Mixer: Multiscale Mixing in LLMs for Time Series Forecas
Links: arXiv PDF
--------------------------------------------------------------------------------

[2] Probabilistic Hierarchical Forecasting with Deep Poisson Mix
Links: arXiv PDF
--------------------------------------------------------------------------------

. 
. ********************************************************************************
. * Example 12: Combine detail + abstract + save
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 12: Comprehensive example (detail + abstract + save)"
Example 12: Comprehensive example (detail + abstract + save)

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. clear

. findar BERT language model, maxresults(2) detail abstract save

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: BERT language model
Max results: 2
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

Starting GitHub search...

  [1/2] The Road to Know-Where: An Object-and-Room Informed Seq...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 1
  Not found:                 0
  Success rate:              50%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Detailed Results
--------------------------------------------------------------------------------

[1] The Road to Know-Where: An Object-and-Room Informed Sequential BERT for Indoor Vision-Language
>  Navigation
Authors: Yuankai Qi, Zizheng Pan, Yicong Hong, Ming-Hsuan Yang, Anton van den Hengel, Qi Wu
Published: 2021-04-09T02:44:39Z

Links: arXiv  Google  GitHub(YuankaiQi/ORIST_★16_C++)
--------------------------------------------------------------------------------

[2] TinyBERT: Distilling BERT for Natural Language Understanding
Authors: Xiaoqi Jiao, Yichun Yin, Lifeng Shang, Xin Jiang, Xiao Chen, Linlin Li, Fang Wang, Qun Li
> u
Published: 2019-09-23T13:05:35Z

Links: arXiv  Google  
--------------------------------------------------------------------------------

Data saved to memory (use browse to view)

. 
. display as text _n "Data structure:"

Data structure:

. describe, short

Contains data
 Observations:             2                  
    Variables:            12                  
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. ********************************************************************************
. * Example 13: Search without saving (default behavior)
. ********************************************************************************
. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "Example 13: Quick search without saving data"
Example 13: Quick search without saving data

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. findar quantum computing, maxresults(2)

--------------------------------------------------------------------------------
arXiv Search + GitHub Integration
--------------------------------------------------------------------------------
Query: quantum computing
Max results: 2
GitHub search: ENABLED (default)
--------------------------------------------------------------------------------
Searching arXiv...
Found 2 papers.

Starting GitHub search...

  [1/2] Tierkreis: A Dataflow Framework for Hybrid Quantum-Clas...

  [2/2] Quantum Computing: Vision and Challenges...

--------------------------------------------------------------------------------
GitHub Search Results:
  Found from arXiv metadata: 0
  Not found:                 2
  Success rate:              0%
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
Top 2 results (arXiv | PDF | DOI | GitHub)
--------------------------------------------------------------------------------

[1] Tierkreis: A Dataflow Framework for Hybrid Quantum-Classical
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

[2] Quantum Computing: Vision and Challenges
Links: arXiv PDF DOI
--------------------------------------------------------------------------------

. 
. display as text _n "Check if data exists:"

Check if data exists:

. capture describe

. if _rc {
.     display as text "  No data in memory (expected behavior)"
. }

. else {
.     display as text "  Data exists in memory"
  Data exists in memory
. }

. 
. ********************************************************************************
. * Cleanup
. ********************************************************************************
. 
. capture erase findar_results.dta

. 
. display as text _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. display as text "All examples completed successfully!"
All examples completed successfully!

. display as text "For more information: help findar"
For more information: help findar

. display as text "{hline 80}"
--------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  D:\User\private\Desktop\stata\findar_final\findar_example.log
  log type:  text
 closed on:  16 Dec 2025, 19:50:29
--------------------------------------------------------------------------------------------------
